In [4]:
import sys
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame({"From_To":['LoNDon_paris', "MAdrid_miLAN", "londON_StockhOlm","Budapest_PaRiS","Brussels_londOn"],
                    "FlightNumber":[10045,np.nan,10065,np.nan,10085]
                   ,"RecentDelays":[[23,47],[],[24,43,87],[13],[67,32]],
                    "Airline":["KLM(!)","<Air France> (12)","(British Airways. )","12. Air France",'''Swiss Air''']
                  })
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRiS           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]            Swiss Air

# Replace nan with 0

In [6]:
df["FlightNumber"] = df["FlightNumber"].replace(np.nan, 0)

# Convert Float value to Integer

In [7]:
df = df.astype({"FlightNumber":'int'})
# df["FlightNumber"] = df["FlightNumber"].astype(int)

In [8]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN             0            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRiS             0          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]            Swiss Air

In [9]:
df.dtypes

From_To         object
FlightNumber     int32
RecentDelays    object
Airline         object
dtype: object

In [10]:
fn = df["FlightNumber"]
fn

0    10045
1        0
2    10065
3        0
4    10085
Name: FlightNumber, dtype: int32

In [11]:
l = []
for i in df["FlightNumber"]:
    l.append(i)
l

[10045, 0, 10065, 0, 10085]

## Iterating on FlightNumber to replace zeroes into proeper series number

In [12]:
for i in range(len(df["FlightNumber"])-1):
    if df["FlightNumber"][i] ==0:
        df["FlightNumber"][i] = df["FlightNumber"][i-1] + 10

<ipython-input-12-75b5adeb8331>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["FlightNumber"][i] = df["FlightNumber"][i-1] + 10

# Replace zeros into proper series number

In [13]:
# in 53
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRiS         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]            Swiss Air

In [14]:
ft = []
for i in df["From_To"].str.title():
    ft.append(i.replace("_"," ").split())
ft

[['London', 'Paris'],
 ['Madrid', 'Milan'],
 ['London', 'Stockholm'],
 ['Budapest', 'Paris'],
 ['Brussels', 'London']]

In [15]:
for i in range(len(ft)):
    print(ft[i][0])

London
Madrid
London
Budapest
Brussels

# Inserting new column to df

In [16]:
df["From"] = [ft[i][0] for i in range(len(ft))]

In [17]:
df["To"] = [ft[i][1] for i in range(len(ft))]

In [18]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRiS,10075,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085,"[67, 32]",Swiss Air,Brussels,London

In [19]:
a = pd.DataFrame(df,columns=["From","To","FlightNumber","RecentDelays","Airline"])
a

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]            Swiss Air

# Recent Delays Data Cleaning

In [21]:
rd = []
for i in range(len(df["RecentDelays"])):
    rd.append(df["RecentDelays"][i])
rd

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [22]:
# length_of_lst_in_RecentDelays as li
li = []
for i in rd:
    li.append(len(i))
    print(len(i))
li

2
0
3
1
2

[2, 0, 3, 1, 2]

In [23]:
for i in rd:
    if len(i)!=3:
        while len(i)<3:
            i.append(0)
rd

[[23, 47, 0], [0, 0, 0], [24, 43, 87], [13, 0, 0], [67, 32, 0]]

In [29]:
samp = [i for i in rd]
samp

[[23, 47, 0], [0, 0, 0], [24, 43, 87], [13, 0, 0], [67, 32, 0]]

# Filling empty spaces with zeroes and replce it as nan value

In [24]:
df["RecentDelays"] = rd

In [25]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47, 0]",KLM(!),London,Paris
1,MAdrid_miLAN,10055,"[0, 0, 0]",<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRiS,10075,"[13, 0, 0]",12. Air France,Budapest,Paris
4,Brussels_londOn,10085,"[67, 32, 0]",Swiss Air,Brussels,London

In [26]:
df["RecentDelays"] = df["RecentDelays"].replace(0, "nan")

In [27]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47, 0]",KLM(!),London,Paris
1,MAdrid_miLAN,10055,"[0, 0, 0]",<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRiS,10075,"[13, 0, 0]",12. Air France,Budapest,Paris
4,Brussels_londOn,10085,"[67, 32, 0]",Swiss Air,Brussels,London

In [28]:
for i in range(len(df["RecentDelays"])):
    print(df["RecentDelays"][i][0], type(df["RecentDelays"][i][0]))

23 <class 'int'>
0 <class 'int'>
24 <class 'int'>
13 <class 'int'>
67 <class 'int'>

# Adding Recent Delay Values

In [34]:
df["Delay-1"] = [samp[i][0] for i in range(len(samp))]

In [36]:
df["Delay-2"] = [samp[i][1] for i in range(len(samp))]

In [37]:
df["Delay-3"] = [samp[i][2] for i in range(len(samp))]

In [38]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To,Delay-1,Delay-2,Delay-3
0,LoNDon_paris,10045,"[23, 47, 0]",KLM(!),London,Paris,23,47,0
1,MAdrid_miLAN,10055,"[0, 0, 0]",<Air France> (12),Madrid,Milan,0,0,0
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24,43,87
3,Budapest_PaRiS,10075,"[13, 0, 0]",12. Air France,Budapest,Paris,13,0,0
4,Brussels_londOn,10085,"[67, 32, 0]",Swiss Air,Brussels,London,67,32,0

In [39]:
a = pd.DataFrame(df, columns=["From","To","FlightNumber","Airline","Delay-1","Delay-2","Delay-3"])
a

,From,To,FlightNumber,Airline,Delay-1,Delay-2,Delay-3
0,London,Paris,10045,KLM(!),23,47,0
1,Madrid,Milan,10055,<Air France> (12),0,0,0
2,London,Stockholm,10065,(British Airways. ),24,43,87
3,Budapest,Paris,10075,12. Air France,13,0,0
4,Brussels,London,10085,Swiss Air,67,32,0

In [79]:
a["Delay-1"] = a["Delay-1"].replace(0, np.nan)
a["Delay-2"] = a["Delay-2"].replace(0, np.nan)
a["Delay-3"] = a["Delay-3"].replace(0, np.nan)

In [80]:
a

,From,To,FlightNumber,Airline,Delay-1,Delay-2,Delay-3
0,London,Paris,10045,KLM,23.0,47.0,NaN
1,Madrid,Milan,10055,Air France,NaN,NaN,NaN
2,London,Stockholm,10065,British Airways,24.0,43.0,87.0
3,Budapest,Paris,10075,Air France,13.0,NaN,NaN
4,Brussels,London,10085,Swiss Air,67.0,32.0,NaN

In [48]:
a.dtypes

From             object
To               object
FlightNumber      int32
Airline          object
Delay-1         float64
Delay-2         float64
Delay-3         float64
dtype: object

In [82]:
a.to_csv("Data_Cleaning_OP.csv")

In [81]:
a.to_json("Data_Cleaning_OP.json")

In [52]:
display(a)

,From,To,FlightNumber,Airline,Delay-1,Delay-2,Delay-3
0,London,Paris,10045,KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055,<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065,(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075,12. Air France,13.0,NaN,NaN
4,Brussels,London,10085,Swiss Air,67.0,32.0,NaN

# Replace unwanted characters in Airline Column

In [53]:
df["Airline"]

0                 KLM(!)
1      <Air France> (12)
2    (British Airways. )
3         12. Air France
4              Swiss Air
Name: Airline, dtype: object

In [55]:
al = []
for i in range(len(df["Airline"])):
    al.append(df["Airline"][i])
al

['KLM(!)',
 '<Air France> (12)',
 '(British Airways. )',
 '12. Air France',
 'Swiss Air']

# Replace Multiple Characters in string

In [76]:
df["Airline"] = df['Airline'].str.replace('[(,),!,.,<,>,12]','')

In [77]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To,Delay-1,Delay-2,Delay-3
0,LoNDon_paris,10045,"[23, 47, 0]",KLM,London,Paris,23,47,0
1,MAdrid_miLAN,10055,"[0, 0, 0]",Air France,Madrid,Milan,0,0,0
2,londON_StockhOlm,10065,"[24, 43, 87]",British Airways,London,Stockholm,24,43,87
3,Budapest_PaRiS,10075,"[13, 0, 0]",Air France,Budapest,Paris,13,0,0
4,Brussels_londOn,10085,"[67, 32, 0]",Swiss Air,Brussels,London,67,32,0

In [83]:
a

,From,To,FlightNumber,Airline,Delay-1,Delay-2,Delay-3
0,London,Paris,10045,KLM,23.0,47.0,NaN
1,Madrid,Milan,10055,Air France,NaN,NaN,NaN
2,London,Stockholm,10065,British Airways,24.0,43.0,87.0
3,Budapest,Paris,10075,Air France,13.0,NaN,NaN
4,Brussels,London,10085,Swiss Air,67.0,32.0,NaN